Data/Section 5/5.1/Clients/VM3_Intance2/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       40801 ops,     474 (avg:     453) ops/sec, 1.69MB/sec (avg: 1.61MB/sec),  4.20 (avg:  4.40) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         226.67          ---          ---      4.21900       235.39
Gets         226.66      1359.96         0.00      4.57100      1415.02
Waits          0.00          ---          ---      0.00000          ---
Totals       453.33      1359.96         0.00      4.39500      1650.41


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.00
SET       1.200         0.06
SET       1.300         0.26
SET       1.400         0.79
SET       1.500         2.00
SET       1.600         3.96
SET       1.700         6.56
SET       1.800         9.86
SET       1.900        13.39
SET       2.000        17.00
SET       2.100        20.63
SET       2.200        24.45
SET       2.300        27.98
SET       2.400        30.76
SET       2.500        33.41
SET       2.600        35.96
SET       2.700        38.24
SET       2.800        40.35
SET       2.900        42.05
SET       3.000        43.79
SET       3.100        45.44
SET       3.200        47.01
SET       3.300        48.40
SET       3.400        49.78
SET       3.500        51.20
SET       3.600        52.61
SET       3.700        54.00
SET       3.800        55.22
SET       3.900        56.52
SET       4.000        57.80
SET       4.100        59.03
SET       4.200        60.26
SET       4.300        61.45
SET       4.400        62.61
SET       4.500        63.85
SET       4.600        65.11
SET       4.700        66.36
SET       4.800        67.66
SET       4.900        68.86
SET       5.000        70.11
SET       5.100        71.33
SET       5.200        72.81
SET       5.300        74.21
SET       5.400        75.32
SET       5.500        76.53
SET       5.600        77.84
SET       5.700        78.98
SET       5.800        80.10
SET       5.900        81.25
SET       6.000        82.21
SET       6.100        83.20
SET       6.200        84.00
SET       6.300        84.75
SET       6.400        85.54
SET       6.500        86.28
SET       6.600        86.91
SET       6.700        87.48
SET       6.800        88.04
SET       6.900        88.62
SET       7.000        89.07
SET       7.100        89.49
SET       7.200        89.98
SET       7.300        90.41
SET       7.400        90.87
SET       7.500        91.32
SET       7.600        91.66
SET       7.700        91.99
SET       7.800        92.39
SET       7.900        92.64
SET       8.000        92.96
SET       8.100        93.34
SET       8.200        93.58
SET       8.300        93.89
SET       8.400        94.13
SET       8.500        94.35
SET       8.600        94.57
SET       8.700        94.79
SET       8.800        94.95
SET       8.900        95.16
SET       9.000        95.43
SET       9.100        95.60
SET       9.200        95.76
SET       9.300        95.95
SET       9.400        96.08
SET       9.500        96.26
SET       9.600        96.47
SET       9.700        96.60
SET       9.800        96.74
SET       9.900        96.87
SET      10.000        97.46
SET      11.000        98.21
SET      12.000        98.60
SET      13.000        98.86
SET      14.000        99.08
SET      15.000        99.29
SET      16.000        99.43
SET      17.000        99.53
SET      18.000        99.61
SET      19.000        99.68
SET      20.000        99.71
SET      21.000        99.77
SET      22.000        99.82
SET      23.000        99.84
SET      24.000        99.88
SET      26.000        99.89
SET      27.000        99.90
SET      29.000        99.91
SET      30.000        99.91
SET      31.000        99.92
SET      32.000        99.93
SET      34.000        99.93
SET      35.000        99.94
SET      36.000        99.95
SET      40.000        99.96
SET      43.000        99.96
SET      47.000        99.97
SET      53.000        99.97
SET      54.000        99.98
SET      58.000        99.98
SET      59.000        99.99
SET      75.000        99.99
SET      76.000       100.00
SET      87.000       100.00
---
GET       1.500         0.04
GET       1.600         0.18
GET       1.700         0.60
GET       1.800         1.61
GET       1.900         3.20
GET       2.000         5.47
GET       2.100         8.38
GET       2.200        11.73
GET       2.300        15.62
GET       2.400        19.58
GET       2.500        23.19
GET       2.600        26.89
GET       2.700        30.04
GET       2.800        33.01
GET       2.900        35.78
GET       3.000        38.01
GET       3.100        40.25
GET       3.200        42.10
GET       3.300        43.96
GET       3.400        45.78
GET       3.500        47.23
GET       3.600        48.92
GET       3.700        50.34
GET       3.800        51.60
GET       3.900        52.81
GET       4.000        54.06
GET       4.100        55.18
GET       4.200        56.44
GET       4.300        57.46
GET       4.400        58.72
GET       4.500        59.79
GET       4.600        60.93
GET       4.700        62.01
GET       4.800        63.12
GET       4.900        64.26
GET       5.000        65.43
GET       5.100        66.70
GET       5.200        67.96
GET       5.300        69.24
GET       5.400        70.46
GET       5.500        71.69
GET       5.600        73.06
GET       5.700        74.30
GET       5.800        75.58
GET       5.900        76.82
GET       6.000        78.00
GET       6.100        79.25
GET       6.200        80.20
GET       6.300        81.28
GET       6.400        82.37
GET       6.500        83.35
GET       6.600        84.24
GET       6.700        85.13
GET       6.800        85.87
GET       6.900        86.53
GET       7.000        87.15
GET       7.100        87.70
GET       7.200        88.21
GET       7.300        88.82
GET       7.400        89.28
GET       7.500        89.77
GET       7.600        90.29
GET       7.700        90.67
GET       7.800        90.95
GET       7.900        91.21
GET       8.000        91.60
GET       8.100        91.93
GET       8.200        92.27
GET       8.300        92.56
GET       8.400        92.82
GET       8.500        93.11
GET       8.600        93.40
GET       8.700        93.70
GET       8.800        93.98
GET       8.900        94.25
GET       9.000        94.54
GET       9.100        94.71
GET       9.200        94.94
GET       9.300        95.10
GET       9.400        95.30
GET       9.500        95.48
GET       9.600        95.61
GET       9.700        95.85
GET       9.800        96.08
GET       9.900        96.26
GET      10.000        96.98
GET      11.000        97.81
GET      12.000        98.33
GET      13.000        98.70
GET      14.000        99.00
GET      15.000        99.21
GET      16.000        99.37
GET      17.000        99.47
GET      18.000        99.59
GET      19.000        99.66
GET      20.000        99.72
GET      21.000        99.79
GET      22.000        99.81
GET      23.000        99.83
GET      24.000        99.86
GET      25.000        99.86
GET      26.000        99.87
GET      27.000        99.88
GET      28.000        99.88
GET      30.000        99.89
GET      31.000        99.90
GET      32.000        99.91
GET      33.000        99.92
GET      36.000        99.94
GET      42.000        99.95
GET      50.000        99.96
GET      51.000        99.97
GET      55.000        99.97
GET      56.000        99.98
GET      62.000        99.98
GET      64.000        99.99
GET      67.000        99.99
GET      84.000       100.00
GET      87.000       100.00
---